<?php
/* vim: set expandtab tabstop=4 shiftwidth=4 softtabstop=4 foldmethod=marker: */
// +---------------------------------------------------------------------------
// | SWAN [ $_SWANBR_SLOGAN_$ ]
// +---------------------------------------------------------------------------
// | Copyright $_SWANBR_COPYRIGHT_$
// +---------------------------------------------------------------------------
// | Version  $_SWANBR_VERSION_$
// +---------------------------------------------------------------------------
// | Licensed ( $_SWANBR_LICENSED_URL_$ )
// +---------------------------------------------------------------------------
// | $_SWANBR_WEB_DOMAIN_$
// +---------------------------------------------------------------------------
 
/**
+------------------------------------------------------------------------------
* 核心处理程序 全局变量
+------------------------------------------------------------------------------
*  
* @version $_SWANBR_VERSION_$
* @copyright $_SWANBR_COPYRIGHT_$
* @author $_SWANBR_AUTHOR_$ 
+------------------------------------------------------------------------------
*/

// {{{ 重要！这个是SWAN_DEV和SWANSOFT中一些参数共享的开始目录

define('D_LINK', '/usr/local/swan/');
// }}}
// {{{  绝对路劲
define('D_PATH_SWAN_SOFT', D_LINK);
define('D_PATH_SWAN_BASE', realpath(dirname(__FILE__)));
    define('D_PATH_SWAN_LIB', D_PATH_SWAN_BASE . '/lib/');
// }}}

